Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/at.h
/*
 * Component description for AT
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-07-26T17:56:43Z  */
#ifndef _PIC32CMSG00_AT_COMPONENT_H_
#define _PIC32CMSG00_AT_COMPONENT_H_

/* ************************************************************************** */
/*                       SOFTWARE API DEFINITION FOR AT                       */
/* ************************************************************************** */

/* -------- AT_CTRLA : (AT Offset: 0x00) (R/W 32) Control Register A -------- */
#define AT_CTRLA_RESETVALUE                   _UINT32_(0x00)                                       /*  (AT_CTRLA) Control Register A  Reset Value */

#define AT_CTRLA_SWRST_Pos                    _UINT32_(0)                                          /* (AT_CTRLA) Software Reset1 = Reset registers , Bus I/F and internal state0 = No effect Position */
#define AT_CTRLA_SWRST_Msk                    (_UINT32_(0x1) << AT_CTRLA_SWRST_Pos)                /* (AT_CTRLA) Software Reset1 = Reset registers , Bus I/F and internal state0 = No effect Mask */
#define AT_CTRLA_SWRST(value)                 (AT_CTRLA_SWRST_Msk & (_UINT32_(value) << AT_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the AT_CTRLA register */
#define AT_CTRLA_PRIV_Pos                     _UINT32_(2)                                          /* (AT_CTRLA) Privileged Access Only Position */
#define AT_CTRLA_PRIV_Msk                     (_UINT32_(0x1) << AT_CTRLA_PRIV_Pos)                 /* (AT_CTRLA) Privileged Access Only Mask */
#define AT_CTRLA_PRIV(value)                  (AT_CTRLA_PRIV_Msk & (_UINT32_(value) << AT_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the AT_CTRLA register */
#define   AT_CTRLA_PRIV_0_Val                 _UINT32_(0x0)                                        /* (AT_CTRLA) AT registers accessible in privileged and unprivileged modes.  */
#define   AT_CTRLA_PRIV_1_Val                 _UINT32_(0x1)                                        /* (AT_CTRLA) AT registers only accessible in privileged mode.  */
#define AT_CTRLA_PRIV_0                       (AT_CTRLA_PRIV_0_Val << AT_CTRLA_PRIV_Pos)           /* (AT_CTRLA) AT registers accessible in privileged and unprivileged modes. Position */
#define AT_CTRLA_PRIV_1                       (AT_CTRLA_PRIV_1_Val << AT_CTRLA_PRIV_Pos)           /* (AT_CTRLA) AT registers only accessible in privileged mode. Position */
#define AT_CTRLA_RUNSTDBY_Pos                 _UINT32_(6)                                          /* (AT_CTRLA) RUNSTDBY Enable Bit Position */
#define AT_CTRLA_RUNSTDBY_Msk                 (_UINT32_(0x1) << AT_CTRLA_RUNSTDBY_Pos)             /* (AT_CTRLA) RUNSTDBY Enable Bit Mask */
#define AT_CTRLA_RUNSTDBY(value)              (AT_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << AT_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the AT_CTRLA register */
#define AT_CTRLA_Msk                          _UINT32_(0x00000045)                                 /* (AT_CTRLA) Register Mask  */


/* -------- AT_TAMPER_KEY : (AT Offset: 0x100) (R/W 32) Tamper Key n Register -------- */
#define AT_TAMPER_KEY_RESETVALUE              _UINT32_(0x00)                                       /*  (AT_TAMPER_KEY) Tamper Key n Register  Reset Value */

#define AT_TAMPER_KEY_TAMPERKEY_Pos           _UINT32_(0)                                          /* (AT_TAMPER_KEY) Tamper Key Value Position */
#define AT_TAMPER_KEY_TAMPERKEY_Msk           (_UINT32_(0xFFFFFFFF) << AT_TAMPER_KEY_TAMPERKEY_Pos) /* (AT_TAMPER_KEY) Tamper Key Value Mask */
#define AT_TAMPER_KEY_TAMPERKEY(value)        (AT_TAMPER_KEY_TAMPERKEY_Msk & (_UINT32_(value) << AT_TAMPER_KEY_TAMPERKEY_Pos)) /* Assignment of value for TAMPERKEY in the AT_TAMPER_KEY register */
#define AT_TAMPER_KEY_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (AT_TAMPER_KEY) Register Mask  */


/* -------- AT_anti_tamper__LEVELA : (AT Offset: 0x200) ( R/ 32) Tamper levels 0 to 7. -------- */
#define AT_anti_tamper__LEVELA_RESETVALUE     _UINT32_(0x00)                                       /*  (AT_anti_tamper__LEVELA) Tamper levels 0 to 7.  Reset Value */

#define AT_anti_tamper__LEVELA_LEVEL0_Pos     _UINT32_(0)                                          /* (AT_anti_tamper__LEVELA) Level 0. Position */
#define AT_anti_tamper__LEVELA_LEVEL0_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL0_Pos) /* (AT_anti_tamper__LEVELA) Level 0. Mask */
#define AT_anti_tamper__LEVELA_LEVEL0(value)  (AT_anti_tamper__LEVELA_LEVEL0_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL0_Pos)) /* Assignment of value for LEVEL0 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL1_Pos     _UINT32_(4)                                          /* (AT_anti_tamper__LEVELA) Level 1. Position */
#define AT_anti_tamper__LEVELA_LEVEL1_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL1_Pos) /* (AT_anti_tamper__LEVELA) Level 1. Mask */
#define AT_anti_tamper__LEVELA_LEVEL1(value)  (AT_anti_tamper__LEVELA_LEVEL1_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL1_Pos)) /* Assignment of value for LEVEL1 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL2_Pos     _UINT32_(8)                                          /* (AT_anti_tamper__LEVELA) Level 2. Position */
#define AT_anti_tamper__LEVELA_LEVEL2_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL2_Pos) /* (AT_anti_tamper__LEVELA) Level 2. Mask */
#define AT_anti_tamper__LEVELA_LEVEL2(value)  (AT_anti_tamper__LEVELA_LEVEL2_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL2_Pos)) /* Assignment of value for LEVEL2 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL3_Pos     _UINT32_(12)                                         /* (AT_anti_tamper__LEVELA) Level 3. Position */
#define AT_anti_tamper__LEVELA_LEVEL3_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL3_Pos) /* (AT_anti_tamper__LEVELA) Level 3. Mask */
#define AT_anti_tamper__LEVELA_LEVEL3(value)  (AT_anti_tamper__LEVELA_LEVEL3_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL3_Pos)) /* Assignment of value for LEVEL3 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL4_Pos     _UINT32_(16)                                         /* (AT_anti_tamper__LEVELA) Level 4. Position */
#define AT_anti_tamper__LEVELA_LEVEL4_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL4_Pos) /* (AT_anti_tamper__LEVELA) Level 4. Mask */
#define AT_anti_tamper__LEVELA_LEVEL4(value)  (AT_anti_tamper__LEVELA_LEVEL4_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL4_Pos)) /* Assignment of value for LEVEL4 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL5_Pos     _UINT32_(20)                                         /* (AT_anti_tamper__LEVELA) Level 5. Position */
#define AT_anti_tamper__LEVELA_LEVEL5_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL5_Pos) /* (AT_anti_tamper__LEVELA) Level 5. Mask */
#define AT_anti_tamper__LEVELA_LEVEL5(value)  (AT_anti_tamper__LEVELA_LEVEL5_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL5_Pos)) /* Assignment of value for LEVEL5 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL6_Pos     _UINT32_(24)                                         /* (AT_anti_tamper__LEVELA) Level 6. Position */
#define AT_anti_tamper__LEVELA_LEVEL6_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL6_Pos) /* (AT_anti_tamper__LEVELA) Level 6. Mask */
#define AT_anti_tamper__LEVELA_LEVEL6(value)  (AT_anti_tamper__LEVELA_LEVEL6_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL6_Pos)) /* Assignment of value for LEVEL6 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_LEVEL7_Pos     _UINT32_(28)                                         /* (AT_anti_tamper__LEVELA) Level 7. Position */
#define AT_anti_tamper__LEVELA_LEVEL7_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELA_LEVEL7_Pos) /* (AT_anti_tamper__LEVELA) Level 7. Mask */
#define AT_anti_tamper__LEVELA_LEVEL7(value)  (AT_anti_tamper__LEVELA_LEVEL7_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELA_LEVEL7_Pos)) /* Assignment of value for LEVEL7 in the AT_anti_tamper__LEVELA register */
#define AT_anti_tamper__LEVELA_Msk            _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__LEVELA) Register Mask  */


/* -------- AT_anti_tamper__LEVELB : (AT Offset: 0x204) ( R/ 32) Tamper levels 8 to 15. -------- */
#define AT_anti_tamper__LEVELB_RESETVALUE     _UINT32_(0x00)                                       /*  (AT_anti_tamper__LEVELB) Tamper levels 8 to 15.  Reset Value */

