Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/pic32cm_sg00_curiosity_pro_trustzone/pic32cm_sg00_curiosity_pro_secure/src/packs/PIC32CM5112SG00100_DFP/component/at.h
#define AT_anti_tamper__LEVELB_LEVEL8_Pos     _UINT32_(0)                                          /* (AT_anti_tamper__LEVELB) Level 8. Position */
#define AT_anti_tamper__LEVELB_LEVEL8_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL8_Pos) /* (AT_anti_tamper__LEVELB) Level 8. Mask */
#define AT_anti_tamper__LEVELB_LEVEL8(value)  (AT_anti_tamper__LEVELB_LEVEL8_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL8_Pos)) /* Assignment of value for LEVEL8 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL9_Pos     _UINT32_(4)                                          /* (AT_anti_tamper__LEVELB) Level 9. Position */
#define AT_anti_tamper__LEVELB_LEVEL9_Msk     (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL9_Pos) /* (AT_anti_tamper__LEVELB) Level 9. Mask */
#define AT_anti_tamper__LEVELB_LEVEL9(value)  (AT_anti_tamper__LEVELB_LEVEL9_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL9_Pos)) /* Assignment of value for LEVEL9 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL10_Pos    _UINT32_(8)                                          /* (AT_anti_tamper__LEVELB) Level 10. Position */
#define AT_anti_tamper__LEVELB_LEVEL10_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL10_Pos) /* (AT_anti_tamper__LEVELB) Level 10. Mask */
#define AT_anti_tamper__LEVELB_LEVEL10(value) (AT_anti_tamper__LEVELB_LEVEL10_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL10_Pos)) /* Assignment of value for LEVEL10 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL11_Pos    _UINT32_(12)                                         /* (AT_anti_tamper__LEVELB) Level 11. Position */
#define AT_anti_tamper__LEVELB_LEVEL11_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL11_Pos) /* (AT_anti_tamper__LEVELB) Level 11. Mask */
#define AT_anti_tamper__LEVELB_LEVEL11(value) (AT_anti_tamper__LEVELB_LEVEL11_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL11_Pos)) /* Assignment of value for LEVEL11 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL12_Pos    _UINT32_(16)                                         /* (AT_anti_tamper__LEVELB) Level 12. Position */
#define AT_anti_tamper__LEVELB_LEVEL12_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL12_Pos) /* (AT_anti_tamper__LEVELB) Level 12. Mask */
#define AT_anti_tamper__LEVELB_LEVEL12(value) (AT_anti_tamper__LEVELB_LEVEL12_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL12_Pos)) /* Assignment of value for LEVEL12 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL13_Pos    _UINT32_(20)                                         /* (AT_anti_tamper__LEVELB) Level 13. Position */
#define AT_anti_tamper__LEVELB_LEVEL13_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL13_Pos) /* (AT_anti_tamper__LEVELB) Level 13. Mask */
#define AT_anti_tamper__LEVELB_LEVEL13(value) (AT_anti_tamper__LEVELB_LEVEL13_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL13_Pos)) /* Assignment of value for LEVEL13 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL14_Pos    _UINT32_(24)                                         /* (AT_anti_tamper__LEVELB) Level 14. Position */
#define AT_anti_tamper__LEVELB_LEVEL14_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL14_Pos) /* (AT_anti_tamper__LEVELB) Level 14. Mask */
#define AT_anti_tamper__LEVELB_LEVEL14(value) (AT_anti_tamper__LEVELB_LEVEL14_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL14_Pos)) /* Assignment of value for LEVEL14 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_LEVEL15_Pos    _UINT32_(28)                                         /* (AT_anti_tamper__LEVELB) Level 15. Position */
#define AT_anti_tamper__LEVELB_LEVEL15_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELB_LEVEL15_Pos) /* (AT_anti_tamper__LEVELB) Level 15. Mask */
#define AT_anti_tamper__LEVELB_LEVEL15(value) (AT_anti_tamper__LEVELB_LEVEL15_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELB_LEVEL15_Pos)) /* Assignment of value for LEVEL15 in the AT_anti_tamper__LEVELB register */
#define AT_anti_tamper__LEVELB_Msk            _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__LEVELB) Register Mask  */


/* -------- AT_anti_tamper__LEVELC : (AT Offset: 0x208) ( R/ 32) Tamper levels 16 to 23. -------- */
#define AT_anti_tamper__LEVELC_RESETVALUE     _UINT32_(0x00)                                       /*  (AT_anti_tamper__LEVELC) Tamper levels 16 to 23.  Reset Value */

#define AT_anti_tamper__LEVELC_LEVEL16_Pos    _UINT32_(0)                                          /* (AT_anti_tamper__LEVELC) Level 16. Position */
#define AT_anti_tamper__LEVELC_LEVEL16_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL16_Pos) /* (AT_anti_tamper__LEVELC) Level 16. Mask */
#define AT_anti_tamper__LEVELC_LEVEL16(value) (AT_anti_tamper__LEVELC_LEVEL16_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL16_Pos)) /* Assignment of value for LEVEL16 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL17_Pos    _UINT32_(4)                                          /* (AT_anti_tamper__LEVELC) Level 17. Position */
#define AT_anti_tamper__LEVELC_LEVEL17_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL17_Pos) /* (AT_anti_tamper__LEVELC) Level 17. Mask */
#define AT_anti_tamper__LEVELC_LEVEL17(value) (AT_anti_tamper__LEVELC_LEVEL17_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL17_Pos)) /* Assignment of value for LEVEL17 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL18_Pos    _UINT32_(8)                                          /* (AT_anti_tamper__LEVELC) Level 18. Position */
#define AT_anti_tamper__LEVELC_LEVEL18_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL18_Pos) /* (AT_anti_tamper__LEVELC) Level 18. Mask */
#define AT_anti_tamper__LEVELC_LEVEL18(value) (AT_anti_tamper__LEVELC_LEVEL18_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL18_Pos)) /* Assignment of value for LEVEL18 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL19_Pos    _UINT32_(12)                                         /* (AT_anti_tamper__LEVELC) Level 19. Position */
#define AT_anti_tamper__LEVELC_LEVEL19_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL19_Pos) /* (AT_anti_tamper__LEVELC) Level 19. Mask */
#define AT_anti_tamper__LEVELC_LEVEL19(value) (AT_anti_tamper__LEVELC_LEVEL19_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL19_Pos)) /* Assignment of value for LEVEL19 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL20_Pos    _UINT32_(16)                                         /* (AT_anti_tamper__LEVELC) Level 20. Position */
#define AT_anti_tamper__LEVELC_LEVEL20_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL20_Pos) /* (AT_anti_tamper__LEVELC) Level 20. Mask */
#define AT_anti_tamper__LEVELC_LEVEL20(value) (AT_anti_tamper__LEVELC_LEVEL20_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL20_Pos)) /* Assignment of value for LEVEL20 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL21_Pos    _UINT32_(20)                                         /* (AT_anti_tamper__LEVELC) Level 21. Position */
#define AT_anti_tamper__LEVELC_LEVEL21_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL21_Pos) /* (AT_anti_tamper__LEVELC) Level 21. Mask */
#define AT_anti_tamper__LEVELC_LEVEL21(value) (AT_anti_tamper__LEVELC_LEVEL21_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL21_Pos)) /* Assignment of value for LEVEL21 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL22_Pos    _UINT32_(24)                                         /* (AT_anti_tamper__LEVELC) Level 22. Position */
#define AT_anti_tamper__LEVELC_LEVEL22_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL22_Pos) /* (AT_anti_tamper__LEVELC) Level 22. Mask */
#define AT_anti_tamper__LEVELC_LEVEL22(value) (AT_anti_tamper__LEVELC_LEVEL22_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL22_Pos)) /* Assignment of value for LEVEL22 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_LEVEL23_Pos    _UINT32_(28)                                         /* (AT_anti_tamper__LEVELC) Level 23. Position */
#define AT_anti_tamper__LEVELC_LEVEL23_Msk    (_UINT32_(0xF) << AT_anti_tamper__LEVELC_LEVEL23_Pos) /* (AT_anti_tamper__LEVELC) Level 23. Mask */
#define AT_anti_tamper__LEVELC_LEVEL23(value) (AT_anti_tamper__LEVELC_LEVEL23_Msk & (_UINT32_(value) << AT_anti_tamper__LEVELC_LEVEL23_Pos)) /* Assignment of value for LEVEL23 in the AT_anti_tamper__LEVELC register */
#define AT_anti_tamper__LEVELC_Msk            _UINT32_(0xFFFFFFFF)                                 /* (AT_anti_tamper__LEVELC) Register Mask  */


/* -------- AT_anti_tamper__LEVELD : (AT Offset: 0x20C) ( R/ 32) Tamper levels 24 to 31. -------- */
#define AT_anti_tamper__LEVELD_RESETVALUE     _UINT32_(0x00)                                       /*  (AT_anti_tamper__LEVELD) Tamper levels 24 to 31.  Reset Value */

